pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/eUSCI_A0_208.0.xml
<module id="eUSCI_A0" HW_revision="208.0">
    <register id="UCA0CTLW0" width="16" offset="0x0" internal="0" description="eUSCI_Ax Control Word Register 0">
        <bitfield id="UCSWRST" description="Software reset enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disabled. eUSCI_A reset released for operation"/>
            <bitenum id="ENABLE" value="0x1" description="Enabled. eUSCI_A logic held in reset state"/>
        </bitfield>
        <bitfield id="UCTXBRK" description="Transmit break" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXBRK_0" value="0x0" description="Next frame transmitted is not a break"/>
            <bitenum id="UCTXBRK_1" value="0x1" description="Next frame transmitted is a break or a break/synch"/>
        </bitfield>
        <bitfield id="UCTXADDR" description="Transmit address" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCTXADDR_0" value="0x0" description="Next frame transmitted is data"/>
            <bitenum id="UCTXADDR_1" value="0x1" description="Next frame transmitted is an address"/>
        </bitfield>
        <bitfield id="UCDORM" description="Dormant" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCDORM_0" value="0x0" description="Not dormant. All received characters set UCRXIFG."/>
            <bitenum id="UCDORM_1" value="0x1" description="Dormant. Only characters that are preceded by an idle-line or with address bit set UCRXIFG. In UART mode with automatic baud-rate detection, only the combination of a break and synch field sets UCRXIFG."/>
        </bitfield>
        <bitfield id="UCBRKIE" description="Receive break character interrupt enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="UCBRKIE_0" value="0x0" description="Received break characters do not set UCRXIFG"/>
            <bitenum id="UCBRKIE_1" value="0x1" description="Received break characters set UCRXIFG"/>
        </bitfield>
        <bitfield id="UCRXEIE" description="Receive erroneous-character interrupt enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCRXEIE_0" value="0x0" description="Erroneous characters rejected and UCRXIFG is not set"/>
            <bitenum id="UCRXEIE_1" value="0x1" description="Erroneous characters received set UCRXIFG"/>
        </bitfield>
        <bitfield id="UCSSEL" description="eUSCI_A clock source select" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="UCLK" value="0x0" description="UCLK"/>
            <bitenum id="ACLK" value="0x1" description="ACLK"/>
            <bitenum id="SMCLK" value="0x2" description="SMCLK"/>
        </bitfield>
        <bitfield id="UCSYNC" description="Synchronous mode enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ASYNC" value="0x0" description="Asynchronous mode"/>
            <bitenum id="SYNC" value="0x1" description="Synchronous mode"/>
        </bitfield>
        <bitfield id="UCMODE" description="eUSCI_A mode" begin="10" end="9" width="2" rwaccess="R/W">
            <bitenum id="UCMODE_0" value="0x0" description="UART mode"/>
            <bitenum id="UCMODE_1" value="0x1" description="Idle-line multiprocessor mode"/>
            <bitenum id="UCMODE_2" value="0x2" description="Address-bit multiprocessor mode"/>
            <bitenum id="UCMODE_3" value="0x3" description="UART mode with automatic baud-rate detection"/>
        </bitfield>
        <bitfield id="UCSPB" description="Stop bit select" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="UCSPB_0" value="0x0" description="One stop bit"/>
            <bitenum id="UCSPB_1" value="0x1" description="Two stop bits"/>
        </bitfield>
        <bitfield id="UC7BIT" description="Character length" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="8BIT" value="0x0" description="8-bit data"/>
            <bitenum id="7BIT" value="0x1" description="7-bit data"/>
        </bitfield>
        <bitfield id="UCMSB" description="MSB first select" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="UCMSB_0" value="0x0" description="LSB first"/>
            <bitenum id="UCMSB_1" value="0x1" description="MSB first"/>
        </bitfield>
        <bitfield id="UCPAR" description="Parity select" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ODD" value="0x0" description="Odd parity"/>
            <bitenum id="EVEN" value="0x1" description="Even parity"/>
        </bitfield>
        <bitfield id="UCPEN" description="Parity enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="UCPEN_0" value="0x0" description="Parity disabled"/>
            <bitenum id="UCPEN_1" value="0x1" description="Parity enabled. Parity bit is generated (UCAxTXD) and expected (UCAxRXD). In address-bit multiprocessor mode, the address bit is included in the parity calculation."/>
        </bitfield>
    </register>
    <register id="UCA0CTLW0_SPI" width="16" offset="0x0" internal="0" description="eUSCI_Ax Control Word Register 0">
        <bitfield id="UCSWRST" description="Software reset enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disabled. eUSCI_A reset released for operation"/>
            <bitenum id="ENABLE" value="0x1" description="Enabled. eUSCI_A logic held in reset state"/>
        </bitfield>
        <bitfield id="UCSTEM" description="STE mode select in master mode." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCSTEM_0" value="0x0" description="STE pin is used to prevent conflicts with other masters"/>
            <bitenum id="UCSTEM_1" value="0x1" description="STE pin is used to generate the enable signal for a 4-wire slave"/>
        </bitfield>
        <bitfield id="UCSSEL" description="eUSCI_A clock source select" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="UCSSEL_0" value="0x0" description="Reserved"/>
            <bitenum id="ACLK" value="0x1" description="ACLK"/>
            <bitenum id="SMCLK" value="0x2" description="SMCLK"/>
        </bitfield>
        <bitfield id="UCSYNC" description="Synchronous mode enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ASYNC" value="0x0" description="Asynchronous mode"/>
            <bitenum id="SYNC" value="0x1" description="Synchronous mode"/>
        </bitfield>
        <bitfield id="UCMODE" description="eUSCI mode" begin="10" end="9" width="2" rwaccess="R/W">
            <bitenum id="UCMODE_0" value="0x0" description="3-pin SPI"/>
            <bitenum id="UCMODE_1" value="0x1" description="4-pin SPI with UCxSTE active high: Slave enabled when UCxSTE = 1"/>
            <bitenum id="UCMODE_2" value="0x2" description="4-pin SPI with UCxSTE active low: Slave enabled when UCxSTE = 0"/>
        </bitfield>
        <bitfield id="UCMST" description="Master mode select" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="SLAVE" value="0x0" description="Slave mode"/>
            <bitenum id="MASTER" value="0x1" description="Master mode"/>
        </bitfield>
        <bitfield id="UC7BIT" description="Character length" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="8BIT" value="0x0" description="8-bit data"/>
            <bitenum id="7BIT" value="0x1" description="7-bit data"/>
        </bitfield>
        <bitfield id="UCMSB" description="MSB first select" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="UCMSB_0" value="0x0" description="LSB first"/>
            <bitenum id="UCMSB_1" value="0x1" description="MSB first"/>
        </bitfield>
        <bitfield id="UCCKPL" description="Clock polarity select" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="The inactive state is low"/>
            <bitenum id="HIGH" value="0x1" description="The inactive state is high"/>
        </bitfield>
        <bitfield id="UCCKPH" description="Clock phase select" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="UCCKPH_0" value="0x0" description="Data is changed on the first UCLK edge and captured on the following edge."/>
            <bitenum id="UCCKPH_1" value="0x1" description="Data is captured on the first UCLK edge and changed on the following edge."/>
        </bitfield>
    </register>
    <register id="UCA0CTLW1" width="16" offset="0x2" internal="0" description="eUSCI_Ax Control Word Register 1">
        <bitfield id="UCGLIT" description="Deglitch time" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="UCGLIT_0" value="0x0" description="Approximately 2 ns (equivalent of 1 delay element)"/>
            <bitenum id="UCGLIT_1" value="0x1" description="Approximately 50 ns"/>
            <bitenum id="UCGLIT_2" value="0x2" description="Approximately 100 ns"/>
            <bitenum id="UCGLIT_3" value="0x3" description="Approximately 200 ns"/>
        </bitfield>
    </register>
    <register id="UCA0BRW" width="16" offset="0x6" internal="0" description="eUSCI_Ax Baud Rate Control Word Register">
    </register>
    <register id="UCA0BRW_SPI" width="16" offset="0x6" internal="0" description="eUSCI_Ax Bit Rate Control Register 1">
    </register>
    <register id="UCA0MCTLW" width="16" offset="0x8" internal="0" description="eUSCI_Ax Modulation Control Word Register">
        <bitfield id="UCOS16" description="Oversampling mode enabled" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCOS16_0" value="0x0" description="Disabled"/>
            <bitenum id="UCOS16_1" value="0x1" description="Enabled"/>
        </bitfield>
        <bitfield id="UCBRF" description="First modulation stage select" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="UCBRS" description="Second modulation stage select" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCA0STATW" width="16" offset="0xA" internal="0" description="eUSCI_Ax Status Register">
        <bitfield id="UCBUSY" description="eUSCI_A busy" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="IDLE" value="0x0" description="eUSCI_A inactive"/>
            <bitenum id="BUSY" value="0x1" description="eUSCI_A transmitting or receiving"/>
        </bitfield>
        <bitfield id="UCADDR_UCIDLE" description="Address received / Idle line detected" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="UCRXERR" description="Receive error flag" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCRXERR_0" value="0x0" description="No receive errors detected"/>
            <bitenum id="UCRXERR_1" value="0x1" description="Receive error detected"/>
        </bitfield>
        <bitfield id="UCBRK" description="Break detect flag" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCBRK_0" value="0x0" description="No break condition"/>
            <bitenum id="UCBRK_1" value="0x1" description="Break condition occurred"/>
        </bitfield>
        <bitfield id="UCPE" description="Parity error flag. When UCPEN = 0, UCPE is read as 0. UCPE is cleared when UCAxRXBUF is read." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="UCPE_0" value="0x0" description="No error"/>
            <bitenum id="UCPE_1" value="0x1" description="Character received with parity error"/>
        </bitfield>
        <bitfield id="UCOE" description="Overrun error flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCOE_0" value="0x0" description="No error"/>
            <bitenum id="UCOE_1" value="0x1" description="Overrun error occurred"/>
        </bitfield>
        <bitfield id="UCFE" description="Framing error flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="UCFE_0" value="0x0" description="No error"/>
            <bitenum id="UCFE_1" value="0x1" description="Character received with low stop bit"/>
        </bitfield>
        <bitfield id="UCLISTEN" description="Listen enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UCLISTEN_0" value="0x0" description="Disabled"/>
            <bitenum id="UCLISTEN_1" value="0x1" description="Enabled. UCAxTXD is internally fed back to the receiver"/>
        </bitfield>
    </register>
    <register id="UCA0STATW_SPI" width="16" offset="0xA" internal="0" description="">
        <bitfield id="UCOE" description="Overrun error flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCOE_0" value="0x0" description="No error"/>
            <bitenum id="UCOE_1" value="0x1" description="Overrun error occurred"/>
        </bitfield>
        <bitfield id="UCFE" description="Framing error flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="UCFE_0" value="0x0" description="No error"/>
            <bitenum id="UCFE_1" value="0x1" description="Bus conflict occurred"/>
        </bitfield>
        <bitfield id="UCLISTEN" description="Listen enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UCLISTEN_0" value="0x0" description="Disabled"/>
            <bitenum id="UCLISTEN_1" value="0x1" description="Enabled. UCAxTXD is internally fed back to the receiver"/>
        </bitfield>
    </register>
    <register id="UCA0RXBUF" width="16" offset="0xC" internal="0" description="eUSCI_Ax Receive Buffer Register">
        <bitfield id="UCRXBUF" description="Receive data buffer" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="UCA0RXBUF_SPI" width="16" offset="0xC" internal="0" description="eUSCI_Ax Receive Buffer Register">
        <bitfield id="UCRXBUF" description="Receive data buffer" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="UCA0TXBUF" width="16" offset="0xE" internal="0" description="eUSCI_Ax Transmit Buffer Register">
        <bitfield id="UCTXBUF" description="Transmit data buffer" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCA0TXBUF_SPI" width="16" offset="0xE" internal="0" description="eUSCI_Ax Transmit Buffer Register">
        <bitfield id="UCTXBUF" description="Transmit data buffer" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCA0ABCTL" width="16" offset="0x10" internal="0" description="eUSCI_Ax Auto Baud Rate Control Register">
        <bitfield id="UCABDEN" description="Automatic baud-rate detect enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCABDEN_0" value="0x0" description="Baud-rate detection disabled. Length of break and synch field is not measured."/>
            <bitenum id="UCABDEN_1" value="0x1" description="Baud-rate detection enabled. Length of break and synch field is measured and baud-rate settings are changed accordingly."/>
        </bitfield>
        <bitfield id="UCBTOE" description="Break time out error" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCBTOE_0" value="0x0" description="No error"/>
            <bitenum id="UCBTOE_1" value="0x1" description="Length of break field exceeded 22 bit times"/>
        </bitfield>
        <bitfield id="UCSTOE" description="Synch field time out error" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCSTOE_0" value="0x0" description="No error"/>
            <bitenum id="UCSTOE_1" value="0x1" description="Length of synch field exceeded measurable time"/>
        </bitfield>
        <bitfield id="UCDELIM" description="Break/synch delimiter length" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="UCDELIM_0" value="0x0" description="1 bit time"/>
            <bitenum id="UCDELIM_1" value="0x1" description="2 bit times"/>
            <bitenum id="UCDELIM_2" value="0x2" description="3 bit times"/>
            <bitenum id="UCDELIM_3" value="0x3" description="4 bit times"/>
        </bitfield>
    </register>
    <register id="UCA0IRCTL" width="16" offset="0x12" internal="0" description="eUSCI_Ax IrDA Control Word Register">
        <bitfield id="UCIREN" description="IrDA encoder/decoder enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCIREN_0" value="0x0" description="IrDA encoder/decoder disabled"/>
            <bitenum id="UCIREN_1" value="0x1" description="IrDA encoder/decoder enabled"/>
        </bitfield>
        <bitfield id="UCIRTXCLK" description="IrDA transmit pulse clock select" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCIRTXCLK_0" value="0x0" description="BRCLK"/>
            <bitenum id="UCIRTXCLK_1" value="0x1" description="BITCLK16 when UCOS16 = 1. Otherwise, BRCLK."/>
        </bitfield>
        <bitfield id="UCIRTXPL" description="Transmit pulse length" begin="7" end="2" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="UCIRRXFE" description="IrDA receive filter enabled" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="UCIRRXFE_0" value="0x0" description="Receive filter disabled"/>
            <bitenum id="UCIRRXFE_1" value="0x1" description="Receive filter enabled"/>
        </bitfield>
        <bitfield id="UCIRRXPL" description="IrDA receive input UCAxRXD polarity" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="HIGH" value="0x0" description="IrDA transceiver delivers a high pulse when a light pulse is seen"/>
            <bitenum id="LOW" value="0x1" description="IrDA transceiver delivers a low pulse when a light pulse is seen"/>
        </bitfield>
        <bitfield id="UCIRRXFL" description="Receive filter length" begin="15" end="10" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCA0IE" width="16" offset="0x1A" internal="0" description="eUSCI_Ax Interrupt Enable Register">
        <bitfield id="UCRXIE" description="Receive interrupt enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE" description="Transmit interrupt enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCSTTIE" description="Start bit interrupt enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCSTTIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCSTTIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXCPTIE" description="Transmit complete interrupt enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCTXCPTIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXCPTIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="UCA0IE_SPI" width="16" offset="0x1A" internal="0" description="eUSCI_Ax Interrupt Enable Register">
        <bitfield id="UCRXIE" description="Receive interrupt enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE" description="Transmit interrupt enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="UCA0IFG" width="16" offset="0x1C" internal="0" description="eUSCI_Ax Interrupt Flag Register">
        <bitfield id="UCRXIFG" description="Receive interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXIFG" description="Transmit interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCSTTIFG" description="Start bit interrupt flag" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCSTTIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCSTTIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXCPTIFG" description="Transmit ready interrupt enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCTXCPTIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXCPTIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="UCA0IFG_SPI" width="16" offset="0x1C" internal="0" description="eUSCI_Ax Interrupt Flag Register">
        <bitfield id="UCRXIFG" description="Receive interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXIFG" description="Transmit interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="UCA0IV" width="16" offset="0x1E" internal="0" description="eUSCI_Ax Interrupt Vector Register">
        <bitfield id="UCIV" description="eUSCI_A interrupt vector value" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG" value="0x2" description="Interrupt Source: Receive buffer full; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest"/>
            <bitenum id="UCTXIFG" value="0x4" description="Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG"/>
            <bitenum id="UCSTTIFG" value="0x6" description="Interrupt Source: Start bit received; Interrupt Flag: UCSTTIFG"/>
            <bitenum id="UCTXCPTIFG" value="0x8" description="Interrupt Source: Transmit complete; Interrupt Flag: UCTXCPTIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
    <register id="UCA0IV_SPI" width="16" offset="0x1E" internal="0" description="eUSCI_Ax Interrupt Vector Register">
        <bitfield id="UCIV" description="eUSCI_A interrupt vector value" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG" value="0x2" description="Interrupt Source: Data received; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest"/>
            <bitenum id="UCTXIFG" value="0x4" description="Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
</module>
